experiments/results/nulldev/631b4b3_zac15_2023-02-24_10:13:27/fio_randrw_64k_64_2.out
randrw_64k_64_2: (g=0): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=io_uring, iodepth=64
...
fio-3.28
Starting 2 threads

randrw_64k_64_2: (groupid=0, jobs=2): err= 0: pid=35343: Fri Feb 24 02:22:10 2023
  read: IOPS=38.6k, BW=2415MiB/s (2532MB/s)(47.2GiB/20035msec)
    slat (nsec): min=5236, max=85727, avg=10696.33, stdev=2291.93
    clat (usec): min=184, max=1712.3k, avg=1523.49, stdev=21953.07
     lat (usec): min=209, max=1712.3k, avg=1534.32, stdev=21952.94
    clat percentiles (usec):
     |  1.00th=[   255],  5.00th=[   273], 10.00th=[   281], 20.00th=[   289],
     | 30.00th=[   297], 40.00th=[   302], 50.00th=[   310], 60.00th=[   318],
     | 70.00th=[   322], 80.00th=[   334], 90.00th=[   355], 95.00th=[   404],
     | 99.00th=[   465], 99.50th=[   498], 99.90th=[316670], 99.95th=[476054],
     | 99.99th=[750781]
   bw (  MiB/s): min= 2102, max= 2728, per=100.00%, avg=2419.07, stdev=65.23, samples=80
   iops        : min=33646, max=43662, avg=38705.20, stdev=1043.78, samples=80
  write: IOPS=38.6k, BW=2415MiB/s (2533MB/s)(47.3GiB/20035msec); 0 zone resets
    slat (nsec): min=6296, max=87942, avg=15114.65, stdev=3220.10
    clat (usec): min=196, max=1644.3k, avg=1790.32, stdev=23931.65
     lat (usec): min=220, max=1644.3k, avg=1805.57, stdev=23931.54
    clat percentiles (usec):
     |  1.00th=[   260],  5.00th=[   277], 10.00th=[   285], 20.00th=[   293],
     | 30.00th=[   302], 40.00th=[   306], 50.00th=[   314], 60.00th=[   318],
     | 70.00th=[   326], 80.00th=[   338], 90.00th=[   355], 95.00th=[   412],
     | 99.00th=[   465], 99.50th=[   502], 99.90th=[429917], 99.95th=[488637],
     | 99.99th=[775947]
   bw (  MiB/s): min= 2112, max= 2744, per=100.00%, avg=2419.47, stdev=67.30, samples=80
   iops        : min=33800, max=43914, avg=38711.48, stdev=1076.70, samples=80
  lat (usec)   : 250=0.40%, 500=99.11%, 750=0.06%, 1000=0.01%
  lat (msec)   : 50=0.01%, 100=0.01%, 250=0.24%, 500=0.15%, 750=0.03%
  lat (msec)   : 1000=0.01%, 2000=0.01%
  cpu          : usr=14.21%, sys=45.67%, ctx=648102, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=774069,774198,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2415MiB/s (2532MB/s), 2415MiB/s-2415MiB/s (2532MB/s-2532MB/s), io=47.2GiB (50.7GB), run=20035-20035msec
  WRITE: bw=2415MiB/s (2533MB/s), 2415MiB/s-2415MiB/s (2533MB/s-2533MB/s), io=47.3GiB (50.7GB), run=20035-20035msec