experiments/results/nulldev/631b4b3_zac15_2023-02-24_10:13:27/fio_read_4k_4_1.out
read_4k_4_1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=4
fio-3.28
Starting 1 thread

read_4k_4_1: (groupid=0, jobs=1): err= 0: pid=38052: Fri Feb 24 02:52:21 2023
  read: IOPS=86.7k, BW=339MiB/s (355MB/s)(6774MiB/20001msec)
    slat (nsec): min=3091, max=34204, avg=4857.98, stdev=697.71
    clat (usec): min=18, max=1094, avg=40.55, stdev=12.08
     lat (usec): min=32, max=1099, avg=45.53, stdev=11.94
    clat percentiles (usec):
     |  1.00th=[   31],  5.00th=[   34], 10.00th=[   34], 20.00th=[   34],
     | 30.00th=[   34], 40.00th=[   35], 50.00th=[   38], 60.00th=[   43],
     | 70.00th=[   44], 80.00th=[   45], 90.00th=[   46], 95.00th=[   48],
     | 99.00th=[  100], 99.50th=[  104], 99.90th=[  109], 99.95th=[  110],
     | 99.99th=[  114]
   bw (  KiB/s): min=346320, max=348072, per=100.00%, avg=346825.32, stdev=310.84, samples=40
   iops        : min=86580, max=87018, avg=86706.43, stdev=77.71, samples=40
  lat (usec)   : 20=0.01%, 50=95.77%, 100=3.26%, 250=0.98%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=16.84%, sys=50.05%, ctx=997972, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1734056,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=339MiB/s (355MB/s), 339MiB/s-339MiB/s (355MB/s-355MB/s), io=6774MiB (7103MB), run=20001-20001msec