experiments/results/nulldev/631b4b3_zac15_2023-02-24_10:13:27/fio_read_64k_4_1.out
read_64k_4_1: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=io_uring, iodepth=4
fio-3.28
Starting 1 thread

read_64k_4_1: (groupid=0, jobs=1): err= 0: pid=46297: Fri Feb 24 04:13:18 2023
  read: IOPS=35.4k, BW=2211MiB/s (2318MB/s)(43.2GiB/20001msec)
    slat (nsec): min=6626, max=72982, avg=9401.36, stdev=668.90
    clat (usec): min=38, max=722, avg=102.88, stdev=15.72
     lat (usec): min=84, max=732, avg=112.40, stdev=15.70
    clat percentiles (usec):
     |  1.00th=[   92],  5.00th=[   96], 10.00th=[   97], 20.00th=[   98],
     | 30.00th=[   98], 40.00th=[   99], 50.00th=[   99], 60.00th=[   99],
     | 70.00th=[  100], 80.00th=[  100], 90.00th=[  103], 95.00th=[  155],
     | 99.00th=[  163], 99.50th=[  169], 99.90th=[  190], 99.95th=[  219],
     | 99.99th=[  265]
   bw (  MiB/s): min= 1707, max= 2226, per=100.00%, avg=2211.11, stdev=81.78, samples=40
   iops        : min=27322, max=35626, avg=35377.72, stdev=1308.50, samples=40
  lat (usec)   : 50=0.01%, 100=77.50%, 250=22.48%, 500=0.02%, 750=0.01%
  cpu          : usr=7.76%, sys=40.65%, ctx=697981, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=707527,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2211MiB/s (2318MB/s), 2211MiB/s-2211MiB/s (2318MB/s-2318MB/s), io=43.2GiB (46.4GB), run=20001-20001msec