experiments/results/nulldev/631b4b3_zac15_2023-02-24_10:13:27/fio_read_8k_8_16.out
read_8k_8_16: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=io_uring, iodepth=8
...
fio-3.28
Starting 16 threads

read_8k_8_16: (groupid=0, jobs=16): err= 0: pid=41074: Fri Feb 24 03:17:08 2023
  read: IOPS=225k, BW=1761MiB/s (1847MB/s)(34.4GiB/20002msec)
    slat (usec): min=3, max=369, avg= 6.22, stdev= 4.98
    clat (usec): min=84, max=56455, avg=560.69, stdev=1150.21
     lat (usec): min=181, max=56461, avg=567.07, stdev=1150.14
    clat percentiles (usec):
     |  1.00th=[  437],  5.00th=[  441], 10.00th=[  445], 20.00th=[  449],
     | 30.00th=[  449], 40.00th=[  453], 50.00th=[  453], 60.00th=[  457],
     | 70.00th=[  457], 80.00th=[  461], 90.00th=[  469], 95.00th=[  486],
     | 99.00th=[  594], 99.50th=[ 8455], 99.90th=[16450], 99.95th=[20317],
     | 99.99th=[28443]
   bw (  MiB/s): min= 1667, max= 1850, per=100.00%, avg=1761.39, stdev= 2.57, samples=640
   iops        : min=213429, max=236882, avg=225457.53, stdev=329.10, samples=640
  lat (usec)   : 100=0.01%, 250=0.01%, 500=96.16%, 750=2.85%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.60%, 20=0.31%, 50=0.08%
  lat (msec)   : 100=0.01%
  cpu          : usr=3.38%, sys=11.00%, ctx=3545786, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4508820,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1761MiB/s (1847MB/s), 1761MiB/s-1761MiB/s (1847MB/s-1847MB/s), io=34.4GiB (36.9GB), run=20002-20002msec