experiments/results/nulldev/631b4b3_zac15_2023-02-24_10:13:27/fio_read_8k_8_2.out
read_8k_8_2: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=io_uring, iodepth=8
...
fio-3.28
Starting 2 threads

read_8k_8_2: (groupid=0, jobs=2): err= 0: pid=40914: Fri Feb 24 03:15:37 2023
  read: IOPS=196k, BW=1534MiB/s (1608MB/s)(30.0GiB/20001msec)
    slat (nsec): min=3363, max=61266, avg=6163.11, stdev=1382.12
    clat (usec): min=40, max=2095, avg=74.63, stdev=15.66
     lat (usec): min=46, max=2103, avg=80.91, stdev=15.57
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   64], 10.00th=[   66], 20.00th=[   68],
     | 30.00th=[   70], 40.00th=[   71], 50.00th=[   72], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   77], 90.00th=[   81], 95.00th=[  121],
     | 99.00th=[  143], 99.50th=[  149], 99.90th=[  155], 99.95th=[  157],
     | 99.99th=[  163]
   bw (  MiB/s): min= 1528, max= 1536, per=100.00%, avg=1533.89, stdev= 0.67, samples=80
   iops        : min=195638, max=196618, avg=196337.60, stdev=86.22, samples=80
  lat (usec)   : 50=0.14%, 100=94.62%, 250=5.24%
  lat (msec)   : 4=0.01%
  cpu          : usr=16.48%, sys=64.40%, ctx=1269517, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3926598,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1534MiB/s (1608MB/s), 1534MiB/s-1534MiB/s (1608MB/s-1608MB/s), io=30.0GiB (32.2GB), run=20001-20001msec