experiments/results/nulldev/631b4b3_zac15_2023-02-24_10:13:27/fio_write_128k_2_2.out
write_128k_2_2: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=io_uring, iodepth=2
...
fio-3.28
Starting 2 threads

write_128k_2_2: (groupid=0, jobs=2): err= 0: pid=61584: Fri Feb 24 06:33:20 2023
  write: IOPS=19.7k, BW=2462MiB/s (2581MB/s)(48.1GiB/20001msec); 0 zone resets
    slat (nsec): min=12102, max=80908, avg=16867.90, stdev=1154.34
    clat (usec): min=116, max=417, avg=185.22, stdev=20.37
     lat (usec): min=174, max=433, avg=202.23, stdev=20.36
    clat percentiles (usec):
     |  1.00th=[  174],  5.00th=[  176], 10.00th=[  176], 20.00th=[  178],
     | 30.00th=[  178], 40.00th=[  180], 50.00th=[  180], 60.00th=[  180],
     | 70.00th=[  182], 80.00th=[  182], 90.00th=[  198], 95.00th=[  239],
     | 99.00th=[  262], 99.50th=[  293], 99.90th=[  322], 99.95th=[  351],
     | 99.99th=[  400]
   bw (  MiB/s): min= 1903, max= 2482, per=100.00%, avg=2461.86, stdev=45.07, samples=80
   iops        : min=15226, max=19862, avg=19694.80, stdev=360.55, samples=80
  lat (usec)   : 250=98.35%, 500=1.65%
  cpu          : usr=3.69%, sys=17.64%, ctx=392398, majf=0, minf=0
  IO depths    : 1=0.0%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,393883,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=2462MiB/s (2581MB/s), 2462MiB/s-2462MiB/s (2581MB/s-2581MB/s), io=48.1GiB (51.6GB), run=20001-20001msec